hans-jorg/stm32f746g/X30-Ethernet/eth.c
/**
 * @file    eth.c
 *
 * @note    ETH interface low level routines
 *
 *
 * @date    10/05/2021
 * @author  Hans
 *
 */



#include "stm32f746xx.h"
#include "system_stm32f746.h"
#include "gpio.h"
#include "eth.h"


/**
 * @brief   Round macro. It returns a value equal or greater than N, that is
 *          a multiple of M.
 * 
 * @param   N: value to be rounded
 * @param   M: rounding parameter, typically, sizeof(type)
 */

#define ROUND(N,M)  ( ( ((N)+(M)-1)/(M) )*(M) )
/**
 * @brief   ETH DMA Descriptor structure
 *
 * @note    From stm32f7xx_hal_eth.h (DMADescTypeDef)
 *
 * @note    Uses extended descriptor format (include PTP info)
 */

/**
 * Function prototypes (forward referenced);
 */
static void ETH_FlushTXFIFO(void);
static int  ETH_UpdateConfig();


/**
 * @brief   Network configuration
 * 
 * @note    AUTONEGOTIATE overrides the other parameters
 *          When Auto Negotiation does not work, use remaining parameters
 */
///@{
#define ETH_CONFIG_AUTONEGOTIATE (1)
#define ETH_CONFIG_100BASET      (2)
#define ETH_CONFIG_10BASET       (4)
#define ETH_CONFIG_FULLDUPLEX    (8)
#define ETH_CONFIG_HALFDUPLEX    (16)
///@}
static const uint32_t ETH_Config =   ETH_CONFIG_AUTONEGOTIATE
// Parameters below only used when Auto Negotiation does not work or not set
                                    |ETH_CONFIG_100BASET
                                    |ETH_CONFIG_FULLDUPLEX;

/**
 * @brief   Ethernet controller status
 */
///@{
#define ETH_STATE_RESET         (0)
#define ETH_STATE_ERROR         (1)
#define ETH_STATE_READY         (2)

static uint32_t ETH_State = ETH_STATE_RESET;
///@}

/**
 * @brief   Ethernet status
 */
///@{

#define ETH_STATUS_LINKDOWN     (1)
#define ETH_STATUS_LINKUP       (2)
#define ETH_STATUS_100BASET     (4)
#define ETH_STATUS_10BASET      (8)
#define ETH_STATUS_FULLDUPLEX   (16)
#define ETH_STATUS_HALFDUPLEX   (32)

static uint32_t ETH_Status = ETH_STATUS_LINKDOWN;
///@}


// 48 bit MAC address (must have 12 hexadecimal digits))
#ifndef ETH_MACADDRESS
#define ETH_MACADDRESS 0x0080E1010101L
#endif


/**
 * @brief   Timing parameters
 * 
 */
///@{
#define ETH_DELAY_AFTERREGISTERWRITE    1000
#define ETH_DELAY_AFTERFLUSH            10
#define ETH_DELAY_AFTERMAC              10
#define ETH_DELAY_AFTERRESET            1000
#define ETH_DELAY_AFTERAUTONEGOTIATION  1000
#define ETH_DELAY_AFTERCONFIG           1000
#define ETH_DELAY_BETWEENTESTS          1000
///@}

/**
 * @brief   Timeout configuration
 */
///@{
#define ETH_RETRIES_AUTONEGOTIATION     100
#define ETH_RETRIES_LINK                1000
//@}
/**
 * @brief   ETH IRQ Configuration
 */

#define ETH_IRQLevel                            (5)

/**
 * @brief   RX and TX descriptors
 * 
 * @note    All sizes are rounded to uint32_t sizes, i.e. multiple of 4.
 */
///@{
#define ETH_TXBUFFERSIZE_UINT32U ROUND(ETH_TXBUFFER_SIZE,sizeof(uint32_t))
#define ETH_RXBUFFERSIZE_UINT32U ROUND(ETH_RXBUFFER_SIZE,sizeof(uint32_t))
#define ETH_TXBUFFERSIZE_UINT8 (ETH_TXBUFFERSIZE_UINT32U*sizeof(uint32_t))
#define ETH_RXBUFFERSIZE_UINT8 (ETH_RXBUFFERSIZE_UINT32U*sizeof(uint32_t))

#ifdef ETH_ALLOCATE_BUFFERS_DYNAMICALLY
    // These pointers must be initialized thru a call to ETH_SetBuffers
    ETH_DMADescriptor               *ETH_TXDescriptors = 0;
    ETH_DMADescriptor               *ETH_RXDescriptors = 0;
    static uint32_t                 *ETH_Area;
    static uint8_t                  *txbuffer = 0;
    static uint8_t                  *rxbuffer = 0;
#else
    static ETH_DMADescriptor         ETH_TXDesc[ETH_TXBUFFER_COUNT] = { 0 };
    static ETH_DMADescriptor         ETH_RXDesc[ETH_RXBUFFER_COUNT] = { 0 };
    ETH_DMADescriptor               *ETH_TXDescriptors = ETH_TXDesc;
    ETH_DMADescriptor               *ETH_RXDescriptors = ETH_RXDesc;
// An alternative is to define as an array of 32-bit integers for alignement
    static uint8_t          txbuffer[ETH_TXBUFFERSIZE_UINT32U*ETH_TXBUFFER_COUNT] 
                                __attribute((aligned(sizeof(uint32_t))));
    static uint8_t          rxbuffer[ETH_RXBUFFERSIZE_UINT32U*ETH_RXBUFFER_COUNT]
                                __attribute((aligned(sizeof(uint32_t))));
#endif
///@}

/**
 * @brief   Callbacks
 */
struct ETH_Callbacks_s ETH_Callbacks       = {0};

/**
 * @brief   Defines for configure PHY
 *
 * @note LAN8742 PHY register description
 *
 *|  # |        | Description                                |  Group          |
 *|----|--------|--------------------------------------------|-----------------|
 *|  0 | BCR    | Basic Control Register                     | Basic           |
 *|  1 | BSR    | Basic Status Register                      | Basic           |
 *|  2 | ID1R   | PHY Identifier 1 Register                  | Extended        |
 *|  3 | ID2R   | PHY Identifier 2 Register                  | Extended        |
 *|  4 | ANAR   | Auto Negotiation Advertisement Register    | Extended        |
 *|  5 | ANLPR  | Auto Negotiation Link Partner Register     | Extended        |
 *|  6 | ANEPR  | Auto Negotiation Expansion Register        | Extended        |
 *|  7 | ANNPTXR| Auto Negotiation Next Page TX Register     | Extended        |
 *|  8 | ANNPRXR| Auto Negotiation Next Page RX Register     | Extended        |
 *| 13 | MMDACR | MMD Access Control Register                | Extended        |
 *| 14 | MMADR  | MMD Access Address/Data Register           | Extended        |
 *| 16 | EDPDR  | EDPD NLP/Crossover TimeRegister            | Vendor-specific |
 *| 17 | MCSR   | Mode Control/Status Register               | Vendor-specific |
 *| 18 | SMR    | Special Modes Register                     | Vendor-specific |
 *| 24 | TDRPDR | TDR Patterns/Delay Control Register        | Vendor-specific |
 *| 25 | TDCSR  | TDR Control/Status Register                | Vendor-specific |
 *| 26 | SECR   | Symbol Error Counter Register              | Vendor-specific |
 *| 27 | SCSIR  | Special Control/Status Indications Register| Vendor-specific |
 *| 28 | CLR    | Cable Length Register                      | Vendor-specific |
 *| 29 | ISFR   | Interrupt Source Flag Register             | Vendor-specific |
 *| 30 | IMR    | Interrupt Mask Register                    | Vendor-specific |
 *| 31 | SCSR   | PHY Special Control/Status Register        | Vendor-specific |
 * 
 * 
 */

/** PHY */
#define ETH_PHY_ADDRESS                         (1)

/** Registers */
///@{
#define ETH_PHY_BCR                             (0)
#define ETH_PHY_BSR                             (1)
#define ETH_PHY_ISFR                           (29)
///@}


