hans-jorg/stm32f746g/X30-Ethernet/eth.c
/** Fields of BCR Register */
///@{
#define ETH_PHY_BCR_RESET                       (uint16_t) (0x8000)
#define ETH_PHY_BCR_LOOPBACK                    (uint16_t) (0x4000)
#define ETH_PHY_BCR_SPEED100MHz                 (uint16_t) (0x2000)
#define ETH_PHY_BCR_AUTONEGOTIATION             (uint16_t) (0x1000)
#define ETH_PHY_BCR_POWERDOWN                   (uint16_t) (0x0800)
///@}

/* Fields of BSR Register */
///@{
#define ETH_PHY_BSR_100BASET_FULLDUPLEX         (uint16_t) (0x4000)
#define ETH_PHY_BSR_100BASET_HALFDUPLEX         (uint16_t) (0x2000)
#define ETH_PHY_BSR_10BASET_FULLDUPLEX          (uint16_t) (0x1000)
#define ETH_PHY_BSR_10BASET_HALFDUPLEX          (uint16_t) (0x0800)
#define ETH_PHY_BSR_AUTONEGOTIATIONCOMPLETED    (uint16_t) (0x0020)
#define ETH_PHY_BSR_LINKUP                      (uint16_t) (0x0004)
///@}

/* Fields of ISFR Register */
///@{
#define ETH_PHY_ISFR_INT8                       (uint16_t) (0x0100)
#define ETH_PHY_ISFR_INT7                       (uint16_t) (0x0080)
#define ETH_PHY_ISFR_INT6                       (uint16_t) (0x0040)
#define ETH_PHY_ISFR_INT5                       (uint16_t) (0x0020)
#define ETH_PHY_ISFR_INT4                       (uint16_t) (0x0010)
#define ETH_PHY_ISFR_INT3                       (uint16_t) (0x0008)
#define ETH_PHY_ISFR_INT2                       (uint16_t) (0x0004)
#define ETH_PHY_ISFR_INT1                       (uint16_t) (0x0002)
///@}





/**
 * @brief   small simple delay routine
 */

static void delay(int count) {
volatile int c = count;

    while( c-- ) {}

}


////////////////// IRQ Handler /////////////////////////////////////////////////////////////////////

/**
 * @brief   ETH interrupt handler
 */

void ETH_IRQHandler(void) {

    // Check if a frame was received
    if( ETH->DMASR&ETH_DMASR_RS ) {
        /* Call back if defined */
        if( ETH_Callbacks.FrameReceived ) ETH_Callbacks.FrameReceived(0);
        ETH->DMASR = ETH_DMASR_RS;
        /* Set State to Ready */
        ETH_State = ETH_STATE_READY;
    }

    // Check if a frame was transmitted
    if( ETH->DMASR&ETH_DMASR_TS ) {
        /* Call back if defined */
        if( ETH_Callbacks.FrameTransmitted ) ETH_Callbacks.FrameTransmitted(0);
        ETH->DMASR = ETH_DMASR_TS;
        /* Set State to Ready */
        ETH_State = ETH_STATE_READY;
    }

    // ETH DMA Error (Abnormal Interrupt Summary)
    if( ETH->DMASR&ETH_DMASR_AIS ) {
        /* Call back if defined */
        if( ETH_Callbacks.ErrorDetected ) ETH_Callbacks.ErrorDetected(0);
        ETH->DMASR = ETH_DMASR_AIS;
        /* Set State to Ready */
        ETH_State = ETH_STATE_READY;
    }

    // Clear interrupt summary
    ETH->DMASR = ETH_DMASR_NIS;
}


////////////////// MAC Address Management //////////////////////////////////////////////////////////

/*
 * @brief   rev64
 *
 * @note    reverse byte order of a 64 bit integer
 */


static uint64_t rev64(uint64_t x) {
uint32_t xh,xl,xt;

    xt = (uint32_t) (x>>32);
    xl = __REV(xt);
    xt = (uint32_t) x;
    xh = __REV(xt);
    x = (((uint64_t) xh)<<32) | (uint64_t) xl;
    return x;

}

/**
 * @brief   Set Mac Address #0
 *
 * @note    The MAC address high register holds the upper 16 bits of the 6-byte 
 *          first MAC address of the station. Note that the first DA byte that 
 *          is received on the MII interface corresponds to the LS Byte 
 *          (bits [7:0]) of the MAC address low register. For example, if
 *          0x1122 3344 5566 is received (0x11 is the first byte) on the MII 
 *          as the destination address, then the MAC address register [47:0]
 *          is compared with 0x6655 4433 2211.
 */
void
ETH_SetMACAddress(uint64_t macaddr) {
uint64_t macaddr_rev;
const uint32_t mo = (1<<31);

    macaddr_rev = rev64(macaddr);

    ETH->MACA0HR =  ((uint32_t) (macaddr_rev>>32)&0xFFFF)|mo;
    ETH->MACA0LR =   (uint32_t) (macaddr_rev);
}

/**
 * @brief   Set MAC Address #0 to #3
 *
 * @note    
 * 
 * @param   n: which MAC Address
 * @param   macaddr: 48-bit MAC Address in a 64-bit variable
 * @param   mbc: Mask byte control, source and address enable flag
 * 
 * @note    See 38.8.2 of RM
 */
#define ETH_MACADDR_MBC_AE      (1<<31)
#define ETH_MACADDR_MBC_SA      (1<<30)
#define ETH_MACADDR_MBC_BYTE5   (1<<29)
#define ETH_MACADDR_MBC_BYTE4   (1<<28)
#define ETH_MACADDR_MBC_BYTE3   (1<<27)
#define ETH_MACADDR_MBC_BYTE2   (1<<26)
#define ETH_MACADDR_MBC_BYTE1   (1<<25)
#define ETH_MACADDR_MBC_BYTE0   (1<<24)

void
ETH_SetMACAddressN(uint32_t n, uint64_t macaddr, uint32_t mbc) {
const uint32_t mo = (1<<31);
uint64_t macaddr_rev;

    macaddr_rev = rev64(macaddr);
    switch(n) {
    case 0:
        ETH->MACA0HR = ((uint32_t) (macaddr_rev>>32)&0xFF)|mo;
        ETH->MACA0LR =  (uint32_t) (macaddr_rev);
        break;
    case 1:
        ETH->MACA1HR = ((uint32_t) (macaddr>>32)&0xFF)|mbc;
        ETH->MACA1LR =  (uint32_t) (macaddr);
        break;
    case 2:
        ETH->MACA2HR = ((uint32_t) (macaddr>>32)&0xFF)|mbc;
        ETH->MACA2LR =  (uint32_t) (macaddr);
        break;
    case 3:
        ETH->MACA3HR = ((uint32_t) (macaddr>>32)&0xFF)|mbc;
        ETH->MACA3LR =  (uint32_t) (macaddr);
        break;
    }

}

/**
 * @brief   Get MAC Address #0 as a vector of bytes
 *
 * @note    Least significant byte first (CPU order)
 */
void
ETH_GetMACAddressAsVector(uint8_t macaddr[6]) {

    macaddr[0] = (ETH_MACADDRESS>>0)&0xFF;
    macaddr[1] = (ETH_MACADDRESS>>8)&0xFF;
    macaddr[2] = (ETH_MACADDRESS>>16)&0xFF;
    macaddr[3] = (ETH_MACADDRESS>>24)&0xFF;
    macaddr[4] = (ETH_MACADDRESS>>32)&0xFF;
    macaddr[5] = (ETH_MACADDRESS>>40)&0xFF;

}

/**
 * @brief   Get MAC Address #0 as a vector of bytes
 *
 * @note    Most significant byte first (Network order)
 */
void
ETH_GetMACAddressAsNetworkOrderedVector(uint8_t macaddr[6]) {

    macaddr[0] = (ETH_MACADDRESS>>40)&0xFF;
    macaddr[1] = (ETH_MACADDRESS>>32)&0xFF;
    macaddr[2] = (ETH_MACADDRESS>>24)&0xFF;
    macaddr[3] = (ETH_MACADDRESS>>16)&0xFF;
    macaddr[4] = (ETH_MACADDRESS>>8)&0xFF;
    macaddr[5] = (ETH_MACADDRESS>>0)&0xFF;

