hans-jorg/stm32f746g/X30-Ethernet/eth.c
    hclkfreq = SystemGetHCLKFrequency();
    cr = 0;
    while( cr_tab[cr].minfreq
        && ( (hclkfreq < cr_tab[cr].minfreq)
            || (hclkfreq > cr_tab[cr].maxfreq)
           )
        ) {
        cr++;
    }
    return cr<<ETH_MACMIIAR_CR_Pos;

}

/**
 * @brief   ETH ConfigureMAC
 *
 * @note    Configuring Media Access Control of the ETH Controller 
 * 
 * @note    MAC Registers
 * 
 *          * MACR: configuration register
 *          * MACFFR: frame filter register
 *          * MACHTHR: hash table high register
 *          * MACHTLR: hash table low register
 *          * MACMIIAR: MII (Media Independent Interface) address register
 *          * MACMIIDR: MII (Media Independent Interface) data register
 *          * MACFCR: flow control register
 *          * MACVLANTR: VLAN tag register
 *          * MACRWUFFR: remote wakeup frame filter register
 *          * MACPMRCSR: PMT (Power Management) control and status register
 *          * MACDBGR: debug register
 *          * MACSR: interrupt status register
 *          * MACIMR: interrupt mask register
 *          * MACA0HR: address 0 high register
 *          * MACA0LR: address 0 low register
 *          * MACA1HR: address 1 high register
 *          * MACA1LR: address 1 low register
 *          * MACA2HR: address 2 high register
 *          * MACA2LR: address 2 low register
 *          * MACA3HR: address 3 high register
 *          * MACA3LR: address 3 low register
 
 * 
 * @note    Configuration generated by STM32CubeMX
 * 
 *          * Watchdog enabled
 *          * Jabber enabled
 *          * Interframe gap set to 96
 *          * Carriersense enabled
 *          * Receive own enable
 *          * Loopback disabled
 *          * Checksum done by hardware
 *          * Retry transmission disabled
 *          * Automatic PAD CRC strip disabled
 *          * Backoff limit set to 10
 *          * Deferral check disabled
 *          * Receive all disabled
 *          * Source address filter disabled
 *          * Block all control frames
 *          * Broadcastframes reception_enabled
 *          * Destination filter normal
 *          * Promiscuous mode disabled
 *          * Multicast frames perfect
 *          * Unicast frames filter perfect
 *          * Zero quanta pause disabled
 *          * Pause low threshold set to -4
 *          * Unicast pause frame detect disabled
 *          * Receive flow control disabled
 *          * Transmit flow control disabled
 *
 */

static int ETH_ConfigureMAC(void) {

    /*************** MACCR: MAC Configuration Register ************************/

    uint32_t maccr = ETH->MACCR;

    // Clear all fields
    maccr &= 0;

    // Configure
    // There are many fields with negative logic (1 to disable, 0 to enable)
    // No CRC stripping
    // Watchdog enable. Receive at most 2048 bytes
    // Jabber enable. Transmit at most 2048 bytes
    // Carrier sense active and generate error/abort transmission
    // Fast Ethernet will be set accordingly later
    // Receive own frames enabled!!!
    // No Loopback
    // Duplex mode will be set accordingly later
    // IPv4 checksum offload (ETH controller calculates CRC)
    // Retry enabled (based on BL)
    // No automatic pad/CRC stripping
    // Back-off limit = 10
    // No deferral check
    // Receiver and transmitter disabled, for now
    maccr |=     0
                |ETH_MACCR_IPCO         // Checksum by hardware
                |ETH_MACCR_IFG_96Bit    // Interframe gap = 96
                |ETH_MACCR_RD           // Retry disable = 1
                |ETH_MACCR_BL_10        // Backoff limit = min(n,4)
                ;

                

    // Set configuration for Fast Ethernet and Full Duplex, when possible
    if( ETH_Status&ETH_CONFIG_100BASET )   maccr |= ETH_MACCR_FES;
    if( ETH_Status&ETH_CONFIG_FULLDUPLEX ) maccr |= ETH_MACCR_DM;

    // Set configuration
    ETH->MACCR = maccr;

    /*************** MACFFR: MAC Frame Filter Register ************************/

    uint32_t macffr = ETH->MACFFR;

    // Clear all fields
    macffr  &= 0;

    // Configure
    // Receive all disabled
    // Perfect filter????
    // Source address filter disabled
    // Source address inverse filter disabled
    // Block all control frames
    // Broadcast frame enabled
    // Pass all multicast depends on Hash multicast bit
    // Destination address inverse filtering normal
    // Hash multicast perfect
    // No promiscuous mode
    macffr |=    0
                |ETH_MACFFR_PCF_BlockAll    // Block all control frames
                ;
    // Set configuration
    ETH->MACFFR = macffr;
    delay(ETH_DELAY_AFTERREGISTERWRITE);

    /*************** MACHTxR: Hash table high/low register ********************/

    ETH->MACHTHR = 0;
    ETH->MACHTLR = 0;

    /*************** MACMIIAR: MII address register ***************************/
    // Used in ConfigurePHY

    /*************** MACMIIDR: MII data register ******************************/
    // Used in ConfigurePHY

    /*************** MACFCR: Flow control register ****************************/

    uint32_t macfcr = ETH->MACFCR;

    // Clear all fields
    macfcr  &= 0;

    // Configure
    // pause time = 0
    // zero quanta pause at normal operation
    // pause low threshold set to Pause time - 4
    // unicast pause frame detect only for multicast address at 802.3 standard
    // receive flow control disabled
    // transmit flow control disabled
    // flow control ??

    macfcr |=    0
                |ETH_MACFCR_PLT_Minus4      // Pause low = Pause time - 4
                 ;

    // Set configuration
    ETH->MACFCR = macfcr;
    delay(ETH_DELAY_AFTERREGISTERWRITE);

    /*************** MACMVLANTR: VLAN tag register ****************************/

    uint32_t macvlantr = ETH->MACVLANTR;

    // Clear all fields
    macvlantr &= 0;

    // Configure
    // 16 bit comparison
    // Tag = 0
    ETH->MACVLANTR  = macvlantr;
    delay(ETH_DELAY_AFTERREGISTERWRITE);

    /*************** MAC Address **********************************************/

    ETH_SetMACAddress(ETH_MACADDRESS);

