hans-jorg/stm32f746g/X30-Ethernet/eth.c
    return 0;
}



/**
 * @brief   Configure DMA
 *
 * @note    Configurate DMA
 * 
 * @note    DMA Registers
 * 
 *          * DMAMBR: Bus mode register
 *          * DMATODR: Transmit poll demand register
 *          * DMARPDR: Receive poll demand register
 *          * DMARDLAR: Receive descriptor list address register
 *          * DMARDLAR: Transmit descriptor list address register
 *          * DMASR: Status register
 *          * DMAOMR: Operation mode register
 *          * DMAIER: Interrupt enable register
 *          * DMAMFBOCR: Missed frame and buffer overflow counter register
 *          * DMARSWTR: Receive status watchdog timer register
 *          * DMACHTDR: Current host transmit descriptor register
 *          * DMACHRDR: Current host receive descriptor register
 *          * DMACHRBAR: Current host transmit buffer address register
 *          * DMACHTBAR: Current host transmit buffer address register
 * 
 *
 * @note    Configuration generated by STM32CubeMX
 * 
 *          * Drop TCP/IP Frame on Checksum error enabled
 *          * Receive store forward enabled
 *          * Flush received frame enable
 *          * Transmit store forward enabled
 *          * Transmit threshold control set to 64 bytes
 *          * Forward error frames disabled
 *          * Forward undersized goodframes disabled
 *          * Received threshold control set to 64 bytes
 *          * Second frame operarted enabled
 *          * Address aligned beats enabled
 *          * Fixed burst_Enabled
 *          * Rx DMA burst length set to 32 beats
 *          * TxDMA burst length_set to 32 beats
 *          * DMA enhanced descriptor enabled
 *          * Descripto length set to 0x0;
 *          * DMA arbitration roundrobin RX/TX 1/1
 */


static int ETH_ConfigureDMA(void) {

    /*************** DMA Mode Register ****************************************/

    uint32_t dmabmr = ETH->DMABMR;

    // Clear all fields
    dmabmr &= 0;

    // Configure
    // Fixed burst for length < 16
    // Address aligned beats enabled
    // PBL mode 4x disabled
    // Separate PBL (Programmable Burst Length) for Rx and TX
    // Rx DMA PBL (Programmable Burst Length)
    // Fixed burst enabled
    // Rx/Tx priority ratio = 1:1
    // Programmable Burst Length (PBL) = 32
    // Enhanced descriptor format enabled (IPv4 offload active)
    // Descriptor skip length = 0
    // DMA arbitration = round robin
    // Software

    dmabmr |=  ETH_DMABMR_AAB
              |ETH_DMABMR_USP
              |ETH_DMABMR_RDP_32Beat
              |ETH_DMABMR_FB
              |ETH_DMABMR_RTPR_1_1
              |ETH_DMABMR_PBL_32Beat
              |ETH_DMABMR_EDE
              ;

    // Configure DMABMR
    ETH->DMABMR = dmabmr;
    delay(ETH_DELAY_AFTERREGISTERWRITE);


    /*************** DMA Operation Mode Register ******************************/
   uint32_t dmaomr = ETH->DMAOMR;

    // clear fields
    dmaomr &= 0;

    // Configure
    // Drop frame with checksum error
    // Receive store and forward enabled
    // Enable flush of received framed
    // Transmit store and forward
    // Flush transmit FIFO (do not touch it yet!)
    // Transmit threshold control = 64 
    // Start/stop transmission (do not touch it yet!)
    // Forward error frames disabled
    // Forward undersized good frames disabled
    // Receive threshold control = 64
    // Operate on second frame enabled
    // Start/stop receive

    dmaomr |= ETH_DMAOMR_RSF
             |ETH_DMAOMR_TSF
             |ETH_DMAOMR_TTC_64Bytes
             |ETH_DMAOMR_RTC_64Bytes
             |ETH_DMAOMR_OSF
             ;
    // Configure DMAOMR
    ETH->DMAOMR = dmaomr;
    delay(ETH_DELAY_AFTERREGISTERWRITE);

    return 0;
}

/**
 * @brief   Symbols for fields in the DMA descriptors
 */

///@{
// This bit is the highest order of word 0 of both descriptors
#define ETH_TXDESC_OWN                   (1<<31)
#define ETH_RXDESC_OWN                   (1<<31)

//** For TX Descriptors **
// These fields are in word 0
#define ETH_TXDESC_CHAINED               (1<<20)
#define ETH_TXDESC_ENDOFRING             (1<<21)
#define ETH_TXDESC_CIC                   (3<<22)
#define ETH_TXDESC_FIRST                 (1<<28)
#define ETH_TXDESC_LAST                  (1<<29)

//** For RX Descriptors **
// These fields are in word 0
#define ETH_RXDESC_RCH                   (1<<14)
#define ETH_RXDESC_FIRST                 (1<<9)
#define ETH_RXDESC_LAST                  (1<<8)
#define ETH_RXDESC_FIELDLENGTH_POS       (16)
#define ETH_RXDESC_FIELDLENGTH_MASK      (0x3FFF0000)
// These fields are in word 1
#define ETH_RXDESC_BUFFER1SIZE_MASK      (0x1FFF)
#define ETH_RXDESC_BUFFER1SIZE_POS       (0)
#define ETH_RXDESC_BUFFER2SIZE_MASK      (0x1FFF0000)
#define ETH_RXDESC_BUFFER2SIZE_POS       (16)
#define ETH_RXDESC_ENDOFRING             (1<<15)
#define ETH_RXDESC_CHAINED               (1<<14)
///@}

#ifdef ETH_ALLOCATE_BUFFERS_DYNAMICALLY
/**
 * @brief   Flags for buffer initialization
 * 
 * @note    ETH_Init must run AFTER buffer initialization
 */
///@{
static uint8_t buffers_initialized = 0;
///@}
#endif


/**
 * @brief ETH ETH_InitTXDescriptors
 *
 * @note  desc must be an array of DMA Descriptor
 *
 * @note  area must be count*ETH_TXBUFFER_SIZE
 *
 * @note  desc and area must be static!!!
 */

void ETH_InitTXDescriptors(ETH_DMADescriptor *desc, int count, uint8_t *area) {
int i;
uint32_t *a = (uint32_t *) area;

    ETH_TXDescriptors = desc;
    for(i=0;i<count;i++) {
        desc->Status    = ETH_TXDESC_CHAINED | ETH_TXDESC_CIC;
        desc->ControlBufferSize = 0;
        desc->Buffer1Addr = (uint32_t) (a + i*ETH_TXBUFFERSIZE_UINT32U);
        desc->Buffer2NextDescAddr = (uint32_t) (desc+((i+1)%count));
        desc++;
    }

    // Write table address to the ETH interface
    ETH->DMATDLAR = (uint32_t) desc;

#ifdef ETH_ALLOCATE_BUFFERS_DYNAMICALLY
    buffers_initialized |= 1;
#endif

}

/**
 * @brief ETH ETH_InitRXDescriptors
 *
 * @note  desc must be an array of DMA Descriptor
 *
 * @note  area must be count*ETH_TXBUFFER_SIZE
 *
 * @note  desc and area must be static!!!
 */


void ETH_InitRXDescriptors(ETH_DMADescriptor *desc, int count, uint8_t *area) {
int i;
uint32_t *a = (uint32_t *) area;

    ETH_RXDescriptors = desc;
    for(i=0;i<count;i++) {
        desc->Status    = ETH_RXDESC_OWN;
        desc->ControlBufferSize = ETH_RXBUFFER_SIZE | ETH_RXDESC_CHAINED;
        desc->Buffer1Addr =  (uint32_t) (a + i*ETH_RXBUFFERSIZE_UINT32U);
        desc->Buffer2NextDescAddr =  (uint32_t) (desc + ((i+1)%count));
        desc++;
    }

    // Write table address to the ETH interface
    ETH->DMARDLAR = (uint32_t) desc;

