hans-jorg/stm32f746g/X30-Ethernet/eth.c
    nbuffers = size/ETH_TXBUFFER_SIZE;
    lastbuffersize = size%ETH_TXBUFFER_SIZE;
    if( lastbuffersize != 0 ) nbuffers++;

    if( nbuffers == 1 ) {
        // Configure first and only descriptor
        desc->Status = ETH_TXDESC_FIRST|ETH_TXDESC_LAST;
        desc->ControlBufferSize = lastbuffersize;
        desc->Status |= ETH_TXDESC_OWN;
    } else {
        // Configure first descriptor
        desc->Status = ETH_TXDESC_FIRST;
        desc->ControlBufferSize = ETH_TXBUFFER_SIZE;
        desc = (ETH_DMADescriptor *) (desc->Buffer2NextDescAddr);
        desc->Status |= ETH_TXDESC_OWN;

        // Configure intermediate descriptors
        for(int i=1;i>nbuffers-1;i++) {
            desc->Status  &= ~(ETH_TXDESC_FIRST|ETH_TXDESC_LAST);
            desc->ControlBufferSize = ETH_TXBUFFER_SIZE;
            desc = (ETH_DMADescriptor *) (desc->Buffer2NextDescAddr);
            desc->Status |= ETH_TXDESC_OWN;
        }
        // Configure last descriptor
        desc->Status = ETH_TXDESC_LAST;
        desc->ControlBufferSize = lastbuffersize;
        desc->Status |= ETH_TXDESC_OWN;
    }

    // Check Transmit buffer status
    if( ETH->DMASR&ETH_DMASR_TBUS ) {
        ETH->DMASR = ETH_DMASR_TBUS;        //
        ETH->DMATPDR = 0;                   // Resume transmission
    }

    return 0;
}



/**
 * @brief   Receive data
 *
 * @note    Check if there is data in buffers and sets an indicator
 *
 * @note    Procedure to receive a multiple buffer frame
 *
 *       1.  Setup receive descriptors
 *       2.  Set OWN bit
 *       3.  Set bit SR in DMAOMR register to start the DMA receive engine
 *       4.  Repeat
 *             Receive data and store it into the buffer pointed by descriptor
 *             Write the first word (+0 offset) with OWN bit cleared and flags set
 *       5.  Until the last segment is received or the descriptor list does not have
 *           descriptors for the DMA engine, i.e,with OWN bit set.
 *
 * @note    To resume operation or force the scan of the descriptor list, a value 
 *          must be written to the DMA
 *
 * @note    All buffers will use the maximum size, except the last one. One must 
 *          get the FL field to get the size of the data in the last buffer.
 */

int
ETH_ReceiveFrame(ETH_DMAFrameInfo *RxFrameInfo) {
int len;
int bsize;
ETH_DMADescriptor *desc;

    // Clean RxFrameInfo
    RxFrameInfo->SegmentCount = 0;
    RxFrameInfo->FirstSegmentDesc = 0;
    RxFrameInfo->LastSegmentDesc = 0;
    RxFrameInfo->FrameLength = 0;

    // Scan descriptors
    desc = ETH_RXDescriptors;
    while( (desc->Status&ETH_RXDESC_OWN) == 0 )  {
        len = (desc->Status&ETH_RXDESC_FIELDLENGTH_MASK)>>ETH_RXDESC_FIELDLENGTH_POS;
        bsize = (desc->ControlBufferSize&ETH_RXDESC_BUFFER1SIZE_MASK)>>ETH_RXDESC_BUFFER1SIZE_POS;
        if( (desc->Status&ETH_RXDESC_FIRST) && (desc->Status&ETH_RXDESC_LAST) ) {
            // Only one buffer
            RxFrameInfo->FirstSegmentDesc = desc;
            RxFrameInfo->LastSegmentDesc  = 0;
            RxFrameInfo->SegmentCount = 1;
            len = (desc->Status&ETH_RXDESC_FIELDLENGTH_MASK)>>ETH_RXDESC_FIELDLENGTH_POS;
            RxFrameInfo->FrameLength = (len-4);      // exclude CRC
            return 1;
        } else if ( desc->Status&ETH_RXDESC_FIRST ) {
            // first buffer
            RxFrameInfo->FirstSegmentDesc = desc;
            RxFrameInfo->LastSegmentDesc  = 0;
            RxFrameInfo->SegmentCount = 1;
            RxFrameInfo->FrameLength = bsize;
        } else if ( desc->Status&ETH_RXDESC_LAST )  {
            // last buffer
            RxFrameInfo->LastSegmentDesc  = desc;
            RxFrameInfo->SegmentCount++;
            RxFrameInfo->FrameLength += (len-4);     // exclude CRC
            return 1;
        } else {
            // intermediary
            RxFrameInfo->SegmentCount++;
            RxFrameInfo->FrameLength += bsize;
        }

        desc = (ETH_DMADescriptor *) desc->Buffer2NextDescAddr;
        if( desc == ETH_RXDescriptors )
            break;
    }
    return 0;
}



/**
 * @brief   Check if a frame has been received
 *
 * @note    Specially the last buffer must have been received
 *
 */
int
ETH_CheckReception(void) {
ETH_DMADescriptor *desc;
uint32_t SegmentCount = 0;

    desc = ETH_RXDescriptors;

    while(desc) {
        if( (desc->Status&ETH_RXDESC_OWN) != 0 )  {
            return 0;
        }

        if( (desc->Status&ETH_RXDESC_FIRST) && (desc->Status&ETH_RXDESC_LAST) ) {
            // Only one buffer
            SegmentCount = 1;
            return 1;
        } else if( desc->Status&ETH_RXDESC_FIRST ) {
            // First buffer
            SegmentCount = 1;
        } else if ( desc->Status&ETH_RXDESC_LAST ) {
            // Last buffer
            SegmentCount++;
            return 1;
        } else {
            // Middle buffer
            SegmentCount++;
        }
        desc = (ETH_DMADescriptor *) desc->Buffer2NextDescAddr;
    }
    return 0;
}



/**
 * @brief   Flush TX FIFO
 *
 */
static void
ETH_FlushTXFIFO(void) {

    ETH->DMAOMR = ETH_DMAOMR_FTF;

    delay(ETH_DELAY_AFTERFLUSH);

    return;
}


/**
 * @brief   ETH Enable/Disable Transmission DMA
 */
///@{
void ETH_EnableTransmissionDMA(void) {

    ETH->DMAOMR |= ETH_DMAOMR_ST;
}

void ETH_DisableTransmissionDMA(void) {

    ETH->DMAOMR &= ~ETH_DMAOMR_ST;
}
///@}


/**
 * @brief   ETH Enable/Disable Reception DMA
 */
///@{
void ETH_EnableReceptionDMA(void) {

    ETH->DMAOMR |= ETH_DMAOMR_SR;
}

void ETH_DisableReceptionDMA(void) {

    ETH->DMAOMR &= ~ETH_DMAOMR_SR;
}
///@}


/**
 * @brief   ETH Enable/Disable Transmission MAC
 */
///@{
void ETH_EnableTransmissionMAC(void) {

    ETH->MACCR |= ETH_MACCR_TE;

    delay(ETH_DELAY_AFTERMAC);
}

void ETH_DisableTransmissionMAC(void) {

    ETH->MACCR &= ~ETH_MACCR_TE;

    delay(ETH_DELAY_AFTERMAC);
}
///@}

/**
 * @brief   ETH Enable/Disable Reception MAC
 */
///@{
void ETH_EnableReceptionMAC(void) {

    ETH->MACCR |= ETH_MACCR_RE;

    delay(ETH_DELAY_AFTERMAC);
}

void ETH_DisableReceptionMAC(void) {

    ETH->MACCR &= ~ETH_MACCR_RE;

    delay(ETH_DELAY_AFTERMAC);
}
///@}


////////////////// Status Functions /////////////////////////////////////////////////////////////

/**
 * @brief  Check link status and return if it up (connected)
 * 
 * @return int 
 */
int  ETH_IsConnected(void) {
int retries = ETH_RETRIES_LINK;
uint32_t value;

        do {
            ETH_ReadPHYRegister(ETH_PHY_BSR,&value);
            delay(ETH_DELAY_BETWEENTESTS);
            retries--;
        } while((retries>0)&&(value&ETH_PHY_BSR_LINKUP)!=ETH_PHY_BSR_LINKUP);

        return (value&ETH_PHY_BSR_LINKUP) == ETH_PHY_BSR_LINKUP;
}

/**
 * @brief   Check if link is up;
 * 
 * @brief   Alias for IsConnected
 * 
 * @return int 
 */
int  ETH_IsLinkUp(void) {

    return ETH_IsConnected();
}

///////////////// Register callback functions ////////////////////////////////////////////////////

/**
 * @brief   Register Callback functions
 *
 * @note    To unregister, set pointer to 0 or NULL
 */
void ETH_RegisterCallback(unsigned which, void (*pFunction)(unsigned) ) {

    switch(which) {
    case ETH_CALLBACK_FRAMERECEIVED:
        ETH_Callbacks.FrameReceived = pFunction;
        break;
    case ETH_CALLBACK_FRAMETRANSMITTED:
        ETH_Callbacks.FrameTransmitted = pFunction;
        break;
    case ETH_CALLBACK_ERRORDETECTED:
        ETH_Callbacks.ErrorDetected = pFunction;
        break;
    case ETH_CALLBACK_LINKSTATUSCHANGED:
        ETH_Callbacks.LinkStatusChanged = pFunction;
    }

    return;
}


